from flask import Flask, render_template
import os

app = Flask(__name__)

@app.route('/')
def index():
    stats = {'reobladnano': 150, 'vidremontovano': 300}
    services = [
        {
            'title': 'Переобладнання StarLink V2 для Вашого авто',
            'description': 'В комплект переобладнання входить: водостійкий корпус, 4 неодимові магніти, PoE інжектор, мікротік.',
            'details': ['водостійкий корпус', '4 неодимові магніти', 'PoE інжектор', 'мікротік']
        },
        {
            'title': 'Ремонт та модернізація STARLINKів',
            'description': 'Заміна корпусу, ремонт пошкодженої плати, переробка розʼєму під RJ 45, переробка роутера STARLINK V2 під RJ 45.',
            'details': ['Заміна корпусу', 'Ремонт пошкодженої плати', 'Переробка розʼєму під RJ 45', 'Переробка роутера STARLINK V2 під RJ 45']
        }
    ]
    poe_injectors = [
        {
            'model': 'YSNEPPU15001A',
            'power': '150 Вт',
            'description': '4-парний інжектор GigE PoE потужністю 150 Вт із захистом від перенапруги.',
            'features': [
                '4 пари високої потужності PoE',
                'Цокольовка: +V: 1,2,3,6 -V: 4,5,7,8',
                'Сумісність: 10/100/1000 Мбіт/с',
                'Захист від перенапруги',
                'Може використовуватися як розгалужувач PoE у разі зворотного підключення'
            ],
            'price': '500 грн'
        },
        {
            'model': 'YSNEPPU32010A',
            'power': '320 Вт',
            'description': '4-парний інжектор GigE PoE потужністю 320 Вт із повним набором непорушних засобів захисту. Більше ніяких клопотів із перегорілими запобіжниками. Вбудовані комплексні функції захисту створені для безпечного та плавного використання. Навіть у разі неправильного підключення або короткого замикання інжектор залишається повністю працездатним після відновлення робочих умов.',
            'features': [
                '4 пари високої потужності PoE',
                'Цокольовка: +V: 1,2,3,6 -V: 4,5,7,8',
                'Сумісність: 10/100/1000 Мбіт/с',
                'Захист від перенапруги',
                'Захист від зниженої напруги',
                'Захист від перевантаження по струму (вимірювання загального струму та струму на кожен контакт)',
                'Захист від неправильної полярності'
            ],
            'price': '1200 грн'
        },
        {
            'model': 'YSNEAPL12001A',
            'power': '120 Вт',
            'description': 'Boost PoE інжектор з повним набором непорушних засобів захисту. Більше ніяких клопотів із перегорілими запобіжниками. Вбудовані комплексні функції захисту створені для безпечного та плавного використання. Навіть у разі неправильного підключення або короткого замикання інжектор залишається повністю працездатним після відновлення робочих умов.',
            'features': [
                '4 пари високої потужності PoE',
                'Цокольовка: +V: 1,2,3,6 -V: 4,5,7,8',
                'Сумісність: 10/100/1000 Мбіт/с',
                'Дистанційний поворот',
                'Нульовий струм очікування',
                'Захист від перенапруги',
                'Захист від зниженої напруги',
                'Захист від перевантаження по струму',
                'Захист від неправильної полярності',
                'Захист від розряду батареї (12v і 24v автовизначення)'
            ],
            'price': '800 грн'
        }
    ]
    cable = {
        'model': 'YSNEACSLDV21A',
        'description': 'Оригінальний кабель Dishy v2 на адаптер RJ45 (T568B).',
        'features': [
            'Перетворює роз’єм SPX dishy v2 на RJ45',
            'Сумісність: 10/100/1000 Мбіт/с',
            'Алюмінієва оболонка',
            'Кабель Ethernet CAT8 довжиною 30 см у комплекті'
        ],
        'price': '300 грн'
    }
    reviews = [
        {'author': 'Іван Кривоніс', 'text': '“Дякую Вашій команді за швидкий та якісний ремонт! Окреме дякую за консультації і те, що завжди на звязку!”'},
        {'author': 'Петро Качур', 'text': '“Ваші майстри дуже якісно переобладнали мій старлінк під мій автомобіль. Термінал працює бездоганно, а я маю швидкісний інтернет тепер навіть далеко в горах. Дуже зручний девайс для тих хто любить відпочивати на природі та бути завжди з якісним інтернетом!”'},
        {'author': 'Лілія Степанко', 'text': '“Наша компанія займається пасажирськими перевезеннями в Європу. Команада Небограй обладнала 5 наших автобусів терміналами Старлінк і тепер пасажири на протязі всієї подорожі мають змогу мати інтернет з швідкістю від 100 Мб. Клієнти приємно вражені таким сервісом та рекомендують тепер тільки нас.”'}
    ]
    return render_template('index.html', stats=stats, services=services, poe_injectors=poe_injectors, 
                           cable=cable, reviews=reviews)

if __name__ == '__main__':
    port = int(os.environ.get('PORT', 5000))
    app.run(host='0.0.0.0', port=port, debug=False)