from flask import Flask, render_template
import os

app = Flask(__name__)

@app.route('/')
def index():
    stats = {'reobladnano': 2500, 'vidremontovano': 17000}  # Округлено до >2500 / >17000
    services = [
        {
            'title': 'Переобладнання StarLink V2 для Вашого авто',
            'description': 'В комплект переобладнання входить: водостійкий корпус, 4 неодимові магніти, PoE інжектор, мікротік.',
            'details': ['водостійкий корпус', '4 неодимові магніти', 'PoE інжектор', 'мікротік']
        },
        {
            'title': 'Ремонт та модернізація STARLINKів',
            'description': 'Заміна корпусу, ремонт пошкодженої плати, переробка розʼєму під RJ 45, переробка роутера STARLINK V2 під RJ 45.',
            'details': ['Заміна корпусу', 'Ремонт пошкодженої плати', 'Переробка розʼєму під RJ 45', 'Переробка роутера STARLINK V2 під RJ 45']
        }
    ]
    reviews = [
        {'author': 'Іван Кривоніс', 'text': '“Дякую Вашій команді за швидкий та якісний ремонт! Окреме дякую за консультації і те, що завжди на звязку!”'},
        {'author': 'Петро Качур', 'text': '“Ваші майстри дуже якісно переобладнали мій старлінк під мій автомобіль. Термінал працює бездоганно, а я маю швидкісний інтернет тепер навіть далеко в горах. Дуже зручний девайс для тих хто любить відпочивати на природі та бути завжди з якісним інтернетом!”'},
        {'author': 'Лілія Степанко', 'text': '“Наша компанія займається пасажирськими перевезеннями в Європу. Команада Небограй обладнала 5 наших автобусів терміналами Старлінк і тепер пасажири на протязі всієї подорожі мають змогу мати інтернет з швідкістю від 100 Мб. Клієнти приємно вражені таким сервісом та рекомендують тепер тільки нас.”'}
    ]
    return render_template('index.html', stats=stats, services=services, reviews=reviews)

@app.route('/about')
def about():
    about_text = """
    НЕБОГРАЙ – це досвідчена команда з ремонту терміналів супутникового зв’язку “STARLINK”. Наша компанія працює вже більше року та має великий досвід у ремонті та модернізації терміналів “STARLINK”.
    
    Ми знаємо, як важливо для наших клієнтів мати функціонуючий термінал супутникового зв’язку, тому ми пропонуємо швидкий та якісний ремонт. Наші фахівці мають високу кваліфікацію та досвід у роботі з терміналами. Ми використовуємо тільки оригінальні запчастини та сучасне обладнання, щоб забезпечити якісний ремонт.
    
    Якщо у вас є проблеми з терміналом супутникового зв’язку  “Старлінк” – звертайтесь до НЕБОГРАЙ! 
    
    Ми готові допомогти вам у вирішенні будь-яких проблем з терміналом та забезпечити швидкий та якісний ремонт.
    
    Наша мета – забезпечити нашим клієнтам надійний та безперебійний супутниковий зв’язок, щоб вони могли користуватися своїми терміналами без будь-яких перешкод.
    """
    return render_template('about.html', about_text=about_text)

@app.route('/contacts')
def contacts():
    contacts = {
        'address': 'вулиця Липинського, 58б 2-й поверх, офіс 2, Львів, Львівська область, 79000',
        'phone': '+38 067 444 81 81 (Signal, WhatsApp)',
        'email': 'nebogray@gmail.com'
    }
    return render_template('contacts.html', contacts=contacts)

@app.route('/thanks')
def thanks():
    reviews = [
        {'author': 'Іван Кривоніс', 'text': '“Дякую Вашій команді за швидкий та якісний ремонт! Окреме дякую за консультації і те, що завжди на звязку!”'},
        {'author': 'Петро Качур', 'text': '“Ваші майстри дуже якісно переобладнали мій старлінк під мій автомобіль. Термінал працює бездоганно, а я маю швидкісний інтернет тепер навіть далеко в горах. Дуже зручний девайс для тих хто любить відпочивати на природі та бути завжди з якісним інтернетом!”'},
        {'author': 'Лілія Степанко', 'text': '“Наша компанія займається пасажирськими перевезеннями в Європу. Команада Небограй обладнала 5 наших автобусів терміналами Старлінк і тепер пасажири на протязі всієї подорожі мають змогу мати інтернет з швідкістю від 100 Мб. Клієнти приємно вражені таким сервісом та рекомендують тепер тільки нас.”'}
    ]
    return render_template('thanks.html', reviews=reviews)

if __name__ == '__main__':
    port = int(os.environ.get('PORT', 5000))
    app.run(host='0.0.0.0', port=port, debug=False)